xml/InformationRegisters/Расш6270_ДоступыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Расш6270_ДоступыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/CommonModules/РозничныеПродажи/Ext/Module.bsl
&Вместо("РеквизитыКассира")
Функция Расш6270_РеквизитыКассира(Кассир, Организация, ДатаВремя)
	РеквизитыКассира = Новый Структура;
	РеквизитыКассира.Вставить("ИНН", "");
	РеквизитыКассира.Вставить("Наименование", НСтр("ru = 'Администратор'"));
	РеквизитыКассира.Вставить("Должность", "");
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Если Организация.ИНН = "312261201888" Тогда
			РеквизитыКассира.ИНН = "312261201888";
			РеквизитыКассира.Наименование = "Коробейникова Ирина Николаевна";
		ИначеЕсли Организация.ИНН = "3122002233" Тогда
			РеквизитыКассира.ИНН = "312201091888";
			РеквизитыКассира.Наименование = "Гусакова Тамара Николаевна";
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЕСТЬNULL(Пользователи.ФизическоеЛицо.ИНН, """") КАК ИНН,
	|	ЕСТЬNULL(Пользователи.ФизическоеЛицо.Наименование, """") КАК Наименование,
	|	"""" КАК Должность
	|ИЗ
	|	РегистрСведений.Расш6270_ДоступыПользователей КАК Расш6270_ДоступыПользователей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Расш6270_ДоступыПользователей.Пользователь = Пользователи.Ссылка
	|ГДЕ
	|	Расш6270_ДоступыПользователей.Пользователь = &Пользователь
	|	И (ВЫРАЗИТЬ(Расш6270_ДоступыПользователей.ОбъектДоступа КАК Справочник.Организации)) = &Организация";
	
	Запрос.УстановитьПараметр("Пользователь", Кассир);
	Запрос.УстановитьПараметр("Организация", Организация);
	ВыборкаРеквизитыКассира = Запрос.Выполнить().Выбрать();
	Если ВыборкаРеквизитыКассира.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаРеквизитыКассира.Наименование) И ЗначениеЗаполнено(ВыборкаРеквизитыКассира.ИНН) Тогда
			РеквизитыКассира.Наименование = СокрЛП(ВыборкаРеквизитыКассира.Наименование);
			РеквизитыКассира.ИНН = ВыборкаРеквизитыКассира.ИНН;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РеквизитыКассира;
КонецФункции
